lihuashe/seneasy-work/RTL8752CJF-4416-5687/app/rcu/rcu_application.c
/**
*********************************************************************************************************
*               Copyright(c) 2015, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* @file      rcu_application.c
* @brief     rcu application implementation
* @details   rcu application implementation
* @author    ken_mei
* @date      2017-07-03
* @version   v0.1
* *********************************************************************************************************
*/
#include <trace.h>
#include <string.h>
#include <gap.h>
#include <gap_adv.h>
#include <gap_bond_le.h>
#include "rcu_gap.h"
#include <profile_server.h>
#include <gap_msg.h>
#include "board.h"
#include <app_msg.h>
#include <rcu_application.h>
#include "hids_rmc.h"
#include "bas.h"
#include "dis.h"
#include "key_handle.h"
#include "os_timer.h"
#include "swtimer.h"
#include "voice.h"
#include "voice_driver.h"
#include "gap_conn_le.h"
#include "vendor_service.h"
#include "rcu_ota_service.h"
#include "rtl876x_wdg.h"
#include "dfu_api.h"
#include "mp_test.h"
#include "hids_rmc.h"
#include "smartrcu_service.h"
#include "ir_app_config.h"
//#include "rcu_dfu_service.h"
#include "patch_header_check.h"
#include "platform_utils.h"
#include "single_tone.h"
#include "math.h"
#include "stdlib.h"
#include "ftl.h"
#if IR_FUN
#include "ir_app_config.h"
#endif
#if FEATURE_SUPPORT_MP_TEST_MODE
#include "data_uart_test.h"
#endif
#if (VOICE_FLOW_SEL == ATV_GOOGLE_VOICE_FLOW)
#include "atvv_service.h"
#elif (VOICE_FLOW_SEL == RTK_GATT_VOICE_FLOW)
#include <voice_service.h>
#endif
#include "gatt_builtin_services.h"
#include "led_driver.h"
#include "battery_driver.h"
#include "version.h"
#include "smartrcu_handle.h"
#if (RCU_HD_PLATFORM_SEL == SRC_4416_5302)
#define HW_VERSION      "S4416A4159-V"
#define FW_VERSION      "V" NAME2STR(1)"."NAME2STR(0)"."NAME2STR(4)

#elif (RCU_HD_PLATFORM_SEL == SRC_4416_5291)
#define HW_VERSION      "S4416A4159"
#define FW_VERSION      "V" NAME2STR(1)"."NAME2STR(1)"."NAME2STR(0)
#elif (RCU_HD_PLATFORM_SEL == SRC_3925_5879)
#define HW_VERSION      "S3925A4502"
#define FW_VERSION      "RC-3925V" NAME2STR(1)"."NAME2STR(0)"."NAME2STR(0)
#endif

/*============================================================================*
 *                              Local Variables
 *============================================================================*/

/*============================================================================*
 *                              Global Variables
 *============================================================================*/
T_APP_GLOBAL_DATA app_global_data;
#if FEATURE_SUPPORT_PRIVACY
T_PRIVACY_STATE app_privacy_state = PRIVACY_STATE_INIT;
T_PRIVACY_ADDR_RESOLUTION_STATE app_privacy_resolution_state = PRIVACY_ADDR_RESOLUTION_DISABLED;
#endif

/*============================================================================*
 *                              External Variables
 *============================================================================*/

/*============================================================================*
 *                              External Functions
 *============================================================================*/
extern void periph_handle_gap_msg(T_IO_MSG  *p_gap_msg);
extern void app_nvic_config(void);
extern bool BTIF_VendorGetResponse(uint8_t *pData, uint8_t len);
/*============================================================================*
 *                              Loacal Functions
 *============================================================================*/
/**
* @brief handler stop adverting reason
* @param   T_STOP_ADV_REASON reason.
* @return  void
*/
static void app_stop_adv_reason_handler(T_STOP_ADV_REASON reason)
{
    switch (reason)
    {
    case STOP_ADV_REASON_POWERKEY:
        APP_PRINT_INFO0("STOP_ADV_REASON_POWERKEY!");
        key_handle_global_data.reconn_key_index = VK_NC;
        rcu_start_adv(ADV_UNDIRECT_POWER);
        break;
    case STOP_ADV_REASON_PAIRING:
        APP_PRINT_INFO0("STOP_ADV_REASON_PAIRING!");
        key_handle_global_data.reconn_key_index = VK_NC;
        rcu_start_adv(ADV_UNDIRECT_PAIRING);
        break;
    case STOP_ADV_REASON_TIMEOUT:
        APP_PRINT_INFO0("STOP_ADV_REASON_TIMEOUT!");
        app_global_data.adv_type = ADV_IDLE;
        key_handle_global_data.reconn_key_index = VK_NC;
        break;
    case STOP_ADV_REASON_LOWPOWER:
        APP_PRINT_INFO0("STOP_ADV_REASON_LOWPOWER!");
        key_handle_global_data.reconn_key_index = VK_NC;
        // app_global_data.rcu_status = RCU_STATUS_LOW_POWER;
        break;
    case STOP_ADV_REASON_UART_CMD:
        APP_PRINT_INFO0("STOP_ADV_REASON_UART_CMD!");
        key_handle_global_data.reconn_key_index = VK_NC;
        break;
    case STOP_ADV_REASON_IDLE:
        APP_PRINT_INFO0("STOP_ADV_REASON_IDLE!");
        if (app_global_data.adv_type == ADV_DIRECT_HDC)
        {
            APP_PRINT_INFO1("[STOP_ADV_REASON_IDLE] retry cnt is %d", app_global_data.direct_adv_cnt);
            if (app_global_data.direct_adv_cnt < MAX_DIRECT_ADV_RETRY_CNT)
            {
                rcu_start_adv(ADV_DIRECT_HDC);
                app_global_data.direct_adv_cnt++;
            }
            else
            {
                app_global_data.direct_adv_cnt = 0;  /* reset direct_adv_cnt to 0 */

                if (key_handle_global_data.reconn_key_index == VK_NC)
                {
                    /* POR reconection direct adv shall be here, just enter idle status */
                }
#if (RCU_HD_PLATFORM_SEL == SRC_4416_5302)
                else if (key_handle_global_data.reconn_key_index == VK_POWER)
#elif (RCU_HD_PLATFORM_SEL == SRC_4416_5291)
                else if (key_handle_global_data.reconn_key_index == MM_POWER)
#elif (RCU_HD_PLATFORM_SEL == SRC_3925_5879)
                else if (key_handle_global_data.reconn_key_index == MM_POWER)
#endif       
                {
                    key_handle_global_data.reconn_key_index = VK_NC;
                    rcu_start_adv(ADV_UNDIRECT_POWER);
                }
                else if (key_handle_global_data.reconn_key_index == MM_AC_Search_Noconnect)
                {
                    key_handle_global_data.reconn_key_index = VK_NC;
                    ir_send_key_press_handle(MM_AC_Search_Noconnect, VK_NC, 1);
                    ir_send_key_release_handle();                    
                }
                else
                {
                    /* other keys */
                    key_handle_global_data.reconn_key_index = VK_NC;
#if FEATURE_SUPPORT_UNDIRECT_PROMPT_ADV
                    rcu_start_adv(ADV_UNDIRECT_PROMPT);
#endif
                }
            }
        }
        break;
    default:
        APP_PRINT_WARN1("Unknown stop_adv_reason: %d", app_global_data.stop_adv_reason);
        key_handle_global_data.reconn_key_index = VK_NC;
        break;
    }
}

/**
* @brief handler disconnect reason
* @param   T_DISCONN_REASON reason.
* @return  void
*/
static void app_disconn_reason_handler(T_DISCONN_REASON reason)
{
    switch (reason)
    {
    case DISCONN_REASON_PAIRING:
        APP_PRINT_INFO0("[GAP_CONN_STATE_DISCONNECTED] DISCONN_REASON_PAIRING");
        rcu_start_adv(ADV_UNDIRECT_PAIRING);
        break;
    case DISCONN_REASON_TIMEOUT:
        APP_PRINT_INFO0("[GAP_CONN_STATE_DISCONNECTED] DISCONN_REASON_TIMEOUT");
        break;
    case DISCONN_REASON_OTA:
        APP_PRINT_INFO0("[GAP_CONN_STATE_DISCONNECTED] DISCONN_REASON_OTA");
        /* switch to OTA and reboot */
        dfu_switch_to_ota_mode();
        WDG_SystemReset(RESET_ALL_EXCEPT_AON, DFU_SWITCH_TO_OTA);
        break;
    case DISCONN_REASON_PAIR_FAILED:
        APP_PRINT_INFO1("[GAP_CONN_STATE_DISCONNECTED] is_link_key_existed = %d",
                        app_global_data.is_link_key_existed);
        if (false == app_global_data.is_link_key_existed)
        {
            APP_PRINT_INFO1("[GAP_CONN_STATE_DISCONNECTED] DISCONN_REASON_PAIR_FAILED, retry cnt is %d",
                            app_global_data.pair_failed_retry_cnt);
            if (app_global_data.pair_failed_retry_cnt < MAX_PAIR_FAILED_RETRY_CNT)
            {
                app_global_data.pair_failed_retry_cnt++;
                rcu_start_adv(ADV_UNDIRECT_PAIRING);
            }
        }
        break;
    case DISCONN_REASON_LOW_POWER:
        APP_PRINT_INFO0("[GAP_CONN_STATE_DISCONNECTED] DISCONN_REASON_LOW_POWER");
        // app_global_data.rcu_status = RCU_STATUS_LOW_POWER;
        break;
    case DISCONN_REASON_UART_CMD:
        APP_PRINT_INFO0("[GAP_CONN_STATE_DISCONNECTED] DISCONN_REASON_UART_CMD");
        break;
#if SUPPORT_SILENT_OTA
    case DISCONN_REASON_SILENT_OTA:
        WDG_SystemReset(RESET_ALL_EXCEPT_AON, DFU_SWITCH_TO_OTA);
        break;
#endif
    default:
        APP_PRINT_WARN1("[GAP_CONN_STATE_DISCONNECTED] unknown reason: %d", app_global_data.disconn_reason);
        break;
    }
}

/******************************************************************
 * @fn          app_general_srv_cb
 * @brief      General service callbacks are handled in this function.
 * @param    p_data  - pointer to callback data
 * @return     T_APP_RESULT
 */
static T_APP_RESULT app_general_srv_cb(T_SERVER_APP_CB_DATA *p_data)
{
    T_APP_RESULT cb_result = APP_RESULT_SUCCESS;

