lihuashe/seneasy-work/RTL8752CJF-4416-5687/app/rcu/rcu_application.c
    APP_PRINT_INFO1("[app_hid_srv_cb] msg_type %d", p_data->msg_type);
    switch (p_data->msg_type)
    {
    case SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION:
        {
            switch (p_data->msg_data.notification_indification_index)
            {
            case HID_NOTIFY_INDICATE_KB_ENABLE:
                APP_PRINT_INFO0("[app_hid_srv_cb] HID_NOTIFY_INDICATE_KB_ENABLE");
                app_global_data.is_keyboard_notify_en = true;
                break;
            case HID_NOTIFY_INDICATE_KB_DISABLE:
                APP_PRINT_INFO0("[app_hid_srv_cb] HID_NOTIFY_INDICATE_KB_DISABLE");
                app_global_data.is_keyboard_notify_en = false;
                break;
#if RCU_VOICE_EN
            case HID_NOTIFY_INDICATE_VOICE_ENABLE:
                APP_PRINT_INFO0("[app_hid_srv_cb] HID_NOTIFY_INDICATE_VOICE_ENABLE");
                app_global_data.is_voice_notify_en = true;
                break;
            case HID_NOTIFY_INDICATE_VOICE_DISABLE:
                APP_PRINT_INFO0("[app_hid_srv_cb] HID_NOTIFY_INDICATE_VOICE_DISABLE");
                app_global_data.is_voice_notify_en = false;
                break;
#endif
#if FEATURE_SUPPORT_MULTIMEDIA_KEYBOARD
            case HID_NOTIFY_INDICATE_MM_KB_ENABLE:
                APP_PRINT_INFO0("[app_hid_srv_cb] HID_NOTIFY_INDICATE_VOICE_ENABLE");
                app_global_data.is_mm_keyboard_notify_en = true;
                break;
            case HID_NOTIFY_INDICATE_MM_KB_DISABLE:
                APP_PRINT_INFO0("[app_hid_srv_cb] HID_NOTIFY_INDICATE_VOICE_DISABLE");
                app_global_data.is_mm_keyboard_notify_en = false;
                break;
#endif
            default:
                break;
            }
        }
        break;

    case SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE:
        {
            APP_PRINT_INFO0("SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE\n");
#if RCU_VOICE_EN
            if (p_data->msg_data.write.write_type == HID_WRITE_VIOCE_CMD)
            {
                uint8_t OutCmd = p_data->msg_data.write.write_parameter.voice_enable;
                voice_handle_messages(VOICE_MSG_BT_WRITE_CMD, &OutCmd);
            }
#endif
        }
        break;
    default:
        break;
    }

    return cb_result;
}

/******************************************************************
 * @fn          app_vendor_srv_cb
 * @brief      Vendor service callbacks are handled in this function.
 * @param    p_data  - pointer to callback data
 * @return     T_APP_RESULT
 */
static T_APP_RESULT app_vendor_srv_cb(T_VENDOR_CALLBACK_DATA *p_data)
{
    T_APP_RESULT cb_result = APP_RESULT_SUCCESS;

    APP_PRINT_INFO1("[app_vendor_srv_cb] msg_type %d", p_data->msg_type);
    switch (p_data->msg_type)
    {
    case SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION:
        {
            if (p_data->msg_data.notification_indification_index == VENDOR_NOTIFY_ENABLE)
            {
                APP_PRINT_INFO0("[app_vendor_srv_cb] VENDOR_NOTIFY_ENABLE");
                server_send_data(0, app_global_data.vendor_srv_id,
                                 BLE_SERVICE_CHAR_VENDOR_HANDSHAKE_INDEX,
                                 (uint8_t *)vendor_svc_handshake_values,
                                 16,
                                 GATT_PDU_TYPE_NOTIFICATION);
            }
            else if (p_data->msg_data.notification_indification_index == VENDOR_NOTIFY_DISABLE)
            {
                APP_PRINT_INFO0("[app_vendor_srv_cb] VENDOR_NOTIFY_DISABLE");
            }
        }
        break;
    case SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE:
        {
            if (p_data->msg_data.write_msg.write_type == VENDOR_WRITE_HANDSHAKE)
            {
                APP_PRINT_INFO0("[app_vendor_srv_cb] SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE");
                memcpy(vendor_svc_handshake_values, p_data->msg_data.write_msg.write_parameter.report_data.report,
                       16);
                if (!BTIF_VendorGetResponse(vendor_svc_handshake_values, 16))
                {
                    APP_PRINT_WARN0("[app_vendor_srv_cb] blueAPI_HandShakeGetResponse failed!");
                    cb_result = APP_RESULT_APP_ERR;
                }
            }
#if FEATURE_SUPPORT_MP_TEST_MODE
            else if (p_data->msg_data.write_msg.write_type == VENDOR_WRITE_TEST_MODE)
            {
                APP_PRINT_INFO1("[app_vendor_srv_cb] msg_data.len = %d.",p_data->msg_data.write_msg.write_parameter.report_data.len);
                uint8_t i = 0;
                uint8_t receive_data[5];
                memcpy(receive_data, p_data->msg_data.write_msg.write_parameter.report_data.report,5);
                for(i = 0;i < 5;i ++){
                    APP_PRINT_INFO2("[app_vendor_srv_cb] receive_data[%d] =0x%x",i,receive_data[i]);
                }
                if(receive_data[0] == 0x54 && receive_data[1] == 0x65 && receive_data[2] == 0x73 &&\
                receive_data[3] == 0x74 && receive_data[4] == 0xF4){                                   
                    uint8_t mm_key_data[1] = {0x00};
                    mm_key_data[0] = 0x01;
                    server_send_data(0, app_global_data.hid_srv_id, GATT_SRV_HID_MM_KB_INPUT_INDEX, \
                                    mm_key_data, sizeof(mm_key_data), GATT_PDU_TYPE_NOTIFICATION);
                    APP_PRINT_INFO0("[app_vendor_srv_cb] Enable test mode flag success!");

                }    

                if(receive_data[0] == 0x54 && receive_data[1] == 0x65 && receive_data[2] == 0x73 &&\
                receive_data[3] == 0x74 && receive_data[4] == 0xF5){  
                    if (mp_test_clear_bond_info()){
                        APP_PRINT_INFO0("[app_vendor_srv_cb] disable test mode flag success!");
                        uint8_t mm_key_data[1] = {0x00};
                        mm_key_data[0] = 0x00;
                        server_send_data(0, app_global_data.hid_srv_id, GATT_SRV_HID_MM_KB_INPUT_INDEX, \
                                        mm_key_data, sizeof(mm_key_data), GATT_PDU_TYPE_NOTIFICATION);
                    }
                    else{
                        APP_PRINT_WARN0("[app_vendor_srv_cb] disable test mode flag failed!");
                        cb_result = APP_RESULT_APP_ERR;
                    }
                }            
            }
#endif
            else
            {
                cb_result = APP_RESULT_APP_ERR;
            }
        }
        break;
    default:
        break;
    }

    return cb_result;
}
/******************************************************************
 * @fn          app_smartrcu_srv_cb
 * @brief      smartrcu service callbacks are handled in this function.
 * @param    p_data  - pointer to callback data
 * @return     T_APP_RESULT
 */
static T_APP_RESULT app_smartrcu_srv_cb(T_SMARTRCU_CALLBACK_DATA *p_data)
{
    T_APP_RESULT cb_result = APP_RESULT_SUCCESS;

    // APP_PRINT_INFO1("[app_smartrcu_srv_cb] msg_type %d", p_data->msg_type);
     switch (p_data->msg_type)
    {
    case SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION:
        {
            if (p_data->msg_data.notification_indification_index == SMARTRCU_NOTIFY_ENABLE)
            {
                APP_PRINT_INFO0("[app_smartrcu_srv_cb] SMARTRCU_NOTIFY_ENABLE");
            }
            else if (p_data->msg_data.notification_indification_index == SMARTRCU_NOTIFY_DISABLE)
            {
                APP_PRINT_INFO0("[app_smartrcu_srv_cb] SMARTRCU_NOTIFY_DISABLE");
            }
        }
        break;
    case SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE:
        {
            if (p_data->msg_data.write_msg.write_type == SMARTRCU_WRITE_DATA)
            {
                uint8_t command_data[40] = {};         
                // APP_PRINT_INFO2("[smartrcu_command_handle] len = %d,p_data->msg_data.write_msg.write_parameter.report_data.report: 0x %b",
                //         p_data->msg_data.write_msg.write_parameter.report_data.len,
                //         TRACE_BINARY(p_data->msg_data.write_msg.write_parameter.report_data.len, p_data->msg_data.write_msg.write_parameter.report_data.report));                
                memcpy(&command_data, p_data->msg_data.write_msg.write_parameter.report_data.report, p_data->msg_data.write_msg.write_parameter.report_data.len);
                smartrcu_command_handle((uint8_t *)&command_data);                
            }
            else
            {
                cb_result = APP_RESULT_APP_ERR;
            }
        }
        break;
    default:
        break;
    }
    return cb_result;
}
/******************************************************************
 * @fn          app_ota_srv_cb
 * @brief      OTA service callbacks are handled in this function.
 * @param    p_data  - pointer to callback data
 * @return     T_APP_RESULT
 */
static T_APP_RESULT app_ota_srv_cb(TOTA_CALLBACK_DATA *p_data)
{
    T_APP_RESULT cb_result = APP_RESULT_SUCCESS;

    switch (p_data->msg_type)
    {
    case SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE:
        if (OTA_WRITE_CHAR_VAL == p_data->msg_data.write.opcode &&
            OTA_VALUE_ENTER == p_data->msg_data.write.u.value)
        {
            /* unlock flash */
#if 0
            uint8_t prev_bp_lv = 0;
            if (1 == flash_sw_protect_unlock_by_addr((0x00800000), &prev_bp_lv))
            {
                APP_PRINT_INFO1("[Flash Set] Flash unlock address = 0x00800000, prev_bp_lv = %d", prev_bp_lv);
            }
            else
            {
                APP_PRINT_INFO0("[Flash Set] Flash unlock address = 0x00800000, unlock error");
            }
#endif
            /* TODO: add OTA battery check */
            APP_PRINT_INFO0("Preparing switch into OTA mode\n");
            /*prepare to enter OTA mode, before switch action, we should disconnect first.*/
            rcu_terminate_connection(DISCONN_REASON_OTA);
        }
#if FEATURE_SUPPORT_MP_TEST_MODE
        else if (OTA_WRITE_TEST_MODE_CHAR_VAL == p_data->msg_data.write.opcode)
        {
            APP_PRINT_INFO1("[MP] Test mode clear operation action: (%d)\n",
                            p_data->msg_data.write.u.value);
            if (true == mp_test_clear_bond_info())
            {
                APP_PRINT_INFO0("[MP] Exit MP test mode.");
                uint8_t exitTestModeData[8] =  {0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0};
                exitTestModeData[2] = 0xFF;
                server_send_data(0, app_global_data.hid_srv_id, GATT_SRV_HID_KB_INPUT_INDEX,
                                 exitTestModeData, sizeof(exitTestModeData), GATT_PDU_TYPE_NOTIFICATION);
            }
        }
#endif
        break;

    default:
        break;
    }

    return cb_result;
}

#if RCU_VOICE_EN
#if (VOICE_FLOW_SEL == ATV_GOOGLE_VOICE_FLOW)
/******************************************************************
 * @fn          app_atv_srv_cb
 * @brief      OTA service callbacks are handled in this function.
 * @param    p_data  - pointer to callback data
 * @return     T_APP_RESULT
 */
static T_APP_RESULT app_atvv_srv_cb(T_ATVV_CALLBACK_DATA *p_data)
{
    bool notify_result = false;
    T_APP_RESULT cb_result = APP_RESULT_SUCCESS;

    switch (p_data->msg_type)
    {
    case SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION:
        {
            /* add user code here */
            switch (p_data->msg_data.notification_indification_index)
            {
            case ATVV_CHAR_RX_NOTIFY_ENABLE:
                APP_PRINT_INFO0("[app_atvv_srv_cb] ATVV_CHAR_RX_NOTIFY_ENABLE");
                app_global_data.is_atv_voice_notify_en = true;
                break;
            case ATVV_CHAR_RX_NOTIFY_DISABLE:
                APP_PRINT_INFO0("[app_atvv_srv_cb] ATVV_CHAR_RX_NOTIFY_DISABLE");
                app_global_data.is_atv_voice_notify_en = false;
                if (ATVV_VERSION_1_0 == atvv_global_data.app_support_version)
                {
                    if (voice_driver_global_data.is_voice_driver_working == true)
                    {
                        voice_handle_atvv_audio_stop(ATV_STOP_REASON_ATVV_CHAR_AUDIO_DISABLE);
                    }
                }
                break;
            default:
                break;
            }
        }
        break;

