lihuashe/seneasy-work/RTL8752CJF-4416-5687/app/rcu/rcu_application.c
    case SERVICE_CALLBACK_TYPE_READ_CHAR_VALUE:
        {
            /* add user code here */
        }
        break;

    case SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE:
        {
            uint8_t report_len = p_data->msg_data.write.write_parameter.report_data.len;
            uint8_t *report_data_ptr = p_data->msg_data.write.write_parameter.report_data.report;

            APP_PRINT_INFO1("[app_atvv_srv_cb] SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE report_len = %d",
                            report_len);

            if ((report_len > 0) && (report_len <= ATVV_CHAR_WRITE_DATA_LEN))
            {
                APP_PRINT_INFO1("[app_atvv_srv_cb] report data = %b", TRACE_BINARY(report_len, report_data_ptr));

                switch (report_data_ptr[0])
                {
                case ATV_TX_OPCODE_GET_CAPS:
                    {
                        /* parse recieved data */
                        uint8_t parsed_version_major = report_data_ptr[1];
                        uint8_t parsed_version_minor = report_data_ptr[2];
                        uint16_t parsed_codecs = ((uint16_t)report_data_ptr[3] << 8) + report_data_ptr[4];

                        APP_PRINT_INFO3("[app_atvv_srv_cb] ATV_TX_OPCODE_GET_CAPS V%d.%d codec = %d",
                                        parsed_version_major, parsed_version_minor, parsed_codecs);

                        /* choose atv version */
                        uint8_t app_support_major_version = (uint8_t)(atvv_global_data.app_support_version >> 8);
                        if (app_support_major_version > parsed_version_major)
                        {
                            app_support_major_version = parsed_version_major;
                            if (app_support_major_version == 0)
                            {
                                atvv_global_data.app_support_version = ATVV_VERSION_0_4;
                            }
                            else
                            {
                                atvv_global_data.app_support_version = ATVV_VERSION_1_0;
                            }
                        }
                        APP_PRINT_INFO3("[app_atvv_srv_cb] APP use ATV version V%d.%d codec = %d",
                                        (uint8_t)(atvv_global_data.app_support_version >> 8), (uint8_t)atvv_global_data.app_support_version,
                                        atvv_global_data.codec_used);

                        /* send response */
                        if (ATVV_VERSION_1_0 == atvv_global_data.app_support_version)
                        {
                            uint8_t mast_support_assistant_interaction_model = report_data_ptr[5];
                            uint16_t audio_frame_size = VOICE_FRAME_SIZE_AFTER_ENC * VOICE_PCM_FRAME_CNT;

                            if (atvv_global_data.assistant_interaction_model > mast_support_assistant_interaction_model)
                            {
                                atvv_global_data.assistant_interaction_model = mast_support_assistant_interaction_model;
                            }
                            APP_PRINT_INFO2("[app_atvv_srv_cb] assistant_interaction_model-- master support: %d, rcu use: %d",
                                            mast_support_assistant_interaction_model, atvv_global_data.assistant_interaction_model);

                            memset(atvv_global_data.char_ctl_data_buff, 0, ATVV_CHAR_CTL_DATA_LEN);
                            atvv_global_data.char_ctl_data_buff[0] = ATV_CTL_OPCODE_GET_CAPS_RESP;
                            atvv_global_data.char_ctl_data_buff[1] = (uint8_t)(atvv_global_data.app_support_version >> 8);
                            atvv_global_data.char_ctl_data_buff[2] = (uint8_t)atvv_global_data.app_support_version;
                            atvv_global_data.char_ctl_data_buff[3] = (uint8_t)
                                                                     atvv_global_data.codec_used; /* codecs supported */
                            atvv_global_data.char_ctl_data_buff[4] =
                                atvv_global_data.assistant_interaction_model; /*assistant interaction model*/
                            atvv_global_data.char_ctl_data_buff[5] = (uint8_t)(audio_frame_size >> 8);
                            atvv_global_data.char_ctl_data_buff[6] = (uint8_t) audio_frame_size;  /* bytes/audio frame size*/
                            atvv_global_data.char_ctl_data_buff[7] = ATVV_DLE_ENABLE_MTU_SIZE_UPDATE; /* ectra configuration */
                            atvv_global_data.char_ctl_data_buff[8] = 0x00;  /* reserved*/
                        }
                        else if (ATVV_VERSION_0_4 == atvv_global_data.app_support_version)
                        {
                            atvv_global_data.assistant_interaction_model = ATV_ASSISTANT_INTERACTION_MODEL_ON_REQUEST;

                            memset(atvv_global_data.char_ctl_data_buff, 0, ATVV_CHAR_CTL_DATA_LEN);
                            atvv_global_data.char_ctl_data_buff[0] = ATV_CTL_OPCODE_GET_CAPS_RESP;
                            atvv_global_data.char_ctl_data_buff[1] = (uint8_t)(atvv_global_data.app_support_version >> 8);
                            atvv_global_data.char_ctl_data_buff[2] = (uint8_t)atvv_global_data.app_support_version;
                            atvv_global_data.char_ctl_data_buff[3] = (uint8_t)(atvv_global_data.codec_used >> 8);
                            atvv_global_data.char_ctl_data_buff[4] = (uint8_t)atvv_global_data.codec_used;  /* codec_used */
                            atvv_global_data.char_ctl_data_buff[5] = 0x00;
                            atvv_global_data.char_ctl_data_buff[6] = (uint8_t)VOICE_REPORT_FRAME_SIZE;  /* bytes/frame */
                            atvv_global_data.char_ctl_data_buff[7] = 0x00;
                            atvv_global_data.char_ctl_data_buff[8] = 0x14;  /* bytes/char */
                        }

                        notify_result = server_send_data(0, app_global_data.atvv_srv_id, GATT_SVC_ATVV_CHAR_CTL_VALUE_INDEX,
                                                         \
                                                         atvv_global_data.char_ctl_data_buff, sizeof(atvv_global_data.char_ctl_data_buff),
                                                         GATT_PDU_TYPE_NOTIFICATION);
                        if (notify_result == false)
                        {
                            APP_PRINT_WARN0("[app_atvv_srv_cb] ATV_TX_OPCODE_GET_CAPS notify failed!");
                        }
                    }
                    break;
#if RCU_VOICE_EN
                case ATV_TX_OPCODE_MIC_OPEN:
                    {
                        APP_PRINT_INFO0("[app_atvv_srv_cb] ATV_TX_OPCODE_MIC_OPEN");
                        LED_ON(LED_1);
                        os_timer_restart(&voice_overtime_led_off_timer, VOICE_OVERTIME_LED_OFF_TIMEOUT);
                        if (ATVV_VERSION_1_0 == atvv_global_data.app_support_version)
                        {
                            if (ATV_ASSISTANT_INTERACTION_MODEL_ON_REQUEST == atvv_global_data.assistant_interaction_model)
                            {
                                if (app_global_data.is_atv_voice_notify_en == true)
                                {
                                    atvv_global_data.audio_consumption_mode = report_data_ptr[1];
                                    if (voice_driver_global_data.is_voice_driver_working == true)
                                    {
                                        voice_handle_atvv_audio_stop(ATV_STOP_REASON_AUDIO_START_COMMAND);
                                    }
                                    voice_handle_atvv_audio_start(ATV_START_REASON_MIC_OPEN_REQUEST);
                                }
                                else
                                {
                                    voice_handle_atvv_mic_open_error(ATV_MIC_OPEN_ERROR_ATVV_CHAR_AUDIO_IS_DISABLE);
                                }
                            }
                            else
                            {
                                APP_PRINT_WARN0("[app_atvv_srv_cb] atv assistant_interaction_model is not ATV_ASSISTANT_INTERACTION_MODEL_ON_REQUEST");
                                voice_handle_atvv_mic_open_error(ATV_MIC_OPEN_ERROR_PTT_HTT_IS_IN_PROGRESS);
                            }
                        }
                        else if (ATVV_VERSION_0_4 == atvv_global_data.app_support_version)
                        {
                            uint16_t parsed_codecs = ((uint16_t)report_data_ptr[1] << 8) + report_data_ptr[2];
                            APP_PRINT_INFO1("[app_atvv_srv_cb] ATV_TX_OPCODE_MIC_OPEN parsed_codecs = %d", parsed_codecs);

                            if ((parsed_codecs & atvv_global_data.codec_used) && app_global_data.is_atv_voice_notify_en)
                            {
                                if (parsed_codecs == ATTV_CODEC_MASK_8K_ADPCM)
                                {
                                    voice_driver_codec_params.codec_sample_rate = SAMPLE_RATE_8KHz;
                                }
                                else if (parsed_codecs == ATTV_CODEC_MASK_16K_ADPCM)
                                {
                                    voice_driver_codec_params.codec_sample_rate = SAMPLE_RATE_16KHz;
                                }
                                voice_handle_atvv_audio_start(ATV_START_REASON_MIC_OPEN_REQUEST);
                            }
                            else
                            {
                                voice_handle_atvv_mic_open_error(ATV_MIC_OPEN_ERROR_RESERVED);
                            }
                        }
                    }
                    break;

                case ATV_TX_OPCODE_MIC_CLOSE:
                    {
                        LED_OFF(LED_1);
                        APP_PRINT_INFO0("[app_atvv_srv_cb] ATV_TX_OPCODE_MIC_CLOSE");
                        APP_PRINT_INFO2("[app_atvv_srv_cb] stream_id-- master: 0x%x, rcu: 0x%x", report_data_ptr[1],
                                        atvv_global_data.stream_id);
                        if (ATVV_VERSION_1_0 == atvv_global_data.app_support_version)
                        {
                            if ((report_data_ptr[1] == 0xff || report_data_ptr[1] == atvv_global_data.stream_id) &&
                                voice_driver_global_data.is_voice_driver_working == true &&
                                atvv_global_data.assistant_interaction_model != ATV_ASSISTANT_INTERACTION_MODEL_HOLD_TO_TALK)
                            {
                                voice_handle_atvv_audio_stop(ATV_STOP_REASON_MIC_CLOSE_MESSAGE);
                            }
                        }
                        else if (ATVV_VERSION_0_4 == atvv_global_data.app_support_version)
                        {
                            voice_handle_atvv_audio_stop(ATV_STOP_REASON_MIC_CLOSE_MESSAGE);
                        }
                    }
                    break;

                case ATV_TX_OPCODE_EXTEND:
                    {
                        APP_PRINT_INFO0("[app_atvv_srv_cb] ATV_TX_OPCODE_EXTEND");
                        APP_PRINT_INFO2("[app_atvv_srv_cb] stream_id-- master: 0x%x, rcu: 0x%x", report_data_ptr[1],
                                        atvv_global_data.stream_id);
                        if (ATVV_VERSION_1_0 == atvv_global_data.app_support_version)
                        {
                            if ((report_data_ptr[1] == 0xff || report_data_ptr[1] == atvv_global_data.stream_id) &&
                                voice_driver_global_data.is_voice_driver_working == true)
                            {
                                APP_PRINT_INFO0("[voice_handle_atvv_audio_stop] ATV_TX_OPCODE_EXTEND");
                                os_timer_restart(&voice_exception_timer, VOICE_TRANSFER_TIMEOUT);
                            }
                        }
                    }
                    break;
#endif
                default:
                    break;
                }
            }
        }
        break;

    default:
        break;
    }

    return cb_result;
}
#endif

