lihuashe/seneasy-work/RTL8752CJF-4416-5687/app/rcu/rcu_application.c
#if (VOICE_FLOW_SEL == RTK_GATT_VOICE_FLOW)
/******************************************************************
 * @fn          app_voice_srv_cb
 * @brief      OTA service callbacks are handled in this function.
 * @param    p_data  - pointer to callback data
 * @return     T_APP_RESULT
 */
static T_APP_RESULT app_voice_srv_cb(T_VOICE_CALLBACK_DATA *p_data)
{
    T_APP_RESULT cb_result = APP_RESULT_SUCCESS;

    switch (p_data->msg_type)
    {
    case SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION:
        {
            /* add user code here */
        }
        break;

    case SERVICE_CALLBACK_TYPE_READ_CHAR_VALUE:
        {
            /* add user code here */
        }
        break;

    case SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE:
        {
            /* add user code here */
        }
        break;

    default:
        break;
    }

    return cb_result;
}
#endif
#endif

/*============================================================================*
 *                              Global Functions
 *============================================================================*/
/**
* @brief   handle bond modify message.
* @param   T_LE_BOND_MODIFY_TYPE type, T_LE_KEY_ENTRY *p_entry
* @return  void
*/
void app_handle_bond_modify_msg(T_LE_BOND_MODIFY_TYPE type, T_LE_KEY_ENTRY *p_entry)
{
    APP_PRINT_INFO1("app_handle_bond_modify_msg  GAP_MSG_LE_BOND_MODIFY_INFO:type=0x%x",
                    type);

    switch (type)
    {
    case LE_BOND_DELETE:
        {
            le_modify_white_list(GAP_WHITE_LIST_OP_REMOVE, p_entry->remote_bd.addr,
                                 (T_GAP_REMOTE_ADDR_TYPE)(p_entry->remote_bd.remote_bd_type));
        }
        break;
    case LE_BOND_ADD:
        {
            le_modify_white_list(GAP_WHITE_LIST_OP_ADD, p_entry->remote_bd.addr,
                                 (T_GAP_REMOTE_ADDR_TYPE)(p_entry->remote_bd.remote_bd_type));
        }
        break;
    case LE_BOND_CLEAR:
        {
            le_modify_white_list(GAP_WHITE_LIST_OP_CLEAR, p_entry->remote_bd.addr,
                                 (T_GAP_REMOTE_ADDR_TYPE)(p_entry->remote_bd.remote_bd_type));
        }
        break;
    default:
        break;
    }
}

/**
* @brief set or get rcu app latency status.
* @param   T_LATENCY_STATUS new_status.
* @return  void
*/
void app_set_latency_status(T_APP_LATENCY_MASK index_bit, T_LATENCY_STATE new_state)
{
    uint8_t retry_cnt = 0;
    bool latency_upate_value = true;

    APP_PRINT_INFO2("[app_set_latency_status] module index = %d, new_state is %d", index_bit,
                    new_state);

    /*0. check new state valid or not */
    if ((new_state != LANTENCY_ON) && (new_state != LANTENCY_OFF))
    {
        APP_PRINT_WARN0("[app_set_latency_status] new_state is invalid");
        return;
    }

    /*1. check latency state is updating */
    if (app_global_data.latency_status.is_updating == true)
    {
        APP_PRINT_INFO0("[app_set_latency_status] latency_status is pending!");
        /* update pending latency status */
        app_global_data.latency_status.is_pending = true;
        app_global_data.latency_status.pending_status = new_state;
        app_global_data.latency_status.pending_index_bit = index_bit;
        return ;
    }

    /*2. update latency data value */
    if (new_state == LANTENCY_OFF)
    {
        app_global_data.latency_status.latency_bits_map |= (1 << index_bit);
    }
    else
    {
        app_global_data.latency_status.latency_bits_map &= ~(1 << index_bit);
    }

    /*3. check whether need update according to latency value*/
    if (0 == app_global_data.latency_status.latency_bits_map)
    {
        /* need enable latency*/
        if (LANTENCY_ON == app_global_data.latency_status.cur_status)
        {
            APP_PRINT_INFO0("[app_set_latency_status] latency_status is already enabled!");
            return;
        }
        latency_upate_value = false;
    }
    else
    {
        /* need disable latency */
        if (LANTENCY_OFF == app_global_data.latency_status.cur_status)
        {
            APP_PRINT_INFO0("[app_set_latency_status] latency_status is already disabled!");
            return;
        }
        latency_upate_value = true;
    }

    /*4. process latency update*/
    while (retry_cnt < MAX_ONOFF_LATENCY_SEND_RETRY_CNT)
    {
        if (le_disable_slave_latency(0, latency_upate_value) == GAP_CAUSE_SUCCESS)
        {
            APP_PRINT_INFO1("[app_set_latency_status] call le_disable_slave_latency successfully, latency bit map: %#x",
                            app_global_data.latency_status.latency_bits_map);
            app_global_data.latency_status.is_pending = false;
            app_global_data.latency_status.is_updating = true;
            app_global_data.latency_status.cur_status = new_state;
            app_global_data.latency_status.cur_index_bit = index_bit;
            return;
        }
        retry_cnt++;
    }

    /*5. check update success or not*/
    if (retry_cnt >= MAX_ONOFF_LATENCY_SEND_RETRY_CNT)
    {
        /* all retry failed */
        APP_PRINT_WARN0("[app_set_latency_status] all retry failed");
        /* TBD: how to handle this scenario */
    }
}

/******************************************************************
 * @fn  app_init_global_data
 * @brief  Initialize global APP data
 * @param  void
 * @return  void
 */
void app_init_global_data(void)
{
    memset(&app_global_data, 0, sizeof(app_global_data));
    app_global_data.mtu_size = 23;
    app_global_data.is_adc_efuse_existed = false;
    app_global_data.is_adc_efuse_existed = ADC_CalibrationInit();
    if (false == app_global_data.is_adc_efuse_existed)
    {
        APP_PRINT_WARN0("Read ADC efuse data error!");
    }

    //uint32_t addr = flash_get_ota_bank_addr_by_sign(SIGNATURE_APP);
    //APP_PRINT_INFO1("Free App Bank Addr  = 0x%X", addr);
    //addr = flash_get_ota_bank_addr_by_sign(SIGNATURE_PATCH_FLASH);
    //APP_PRINT_INFO1("Free Patch Bank Addr  = 0x%X", addr);
}
/******************************************************************
 * @fn          app_handle_io_msg
 * @brief      All the application events are pre-handled in this function.
 *                All the IO MSGs are sent to this function, Then the event handling function
 *                shall be called according to the MSG type.
 *
 * @param    io_driver_msg_recv  - bee io msg data
 * @return     void
 */
void app_handle_io_msg(T_IO_MSG io_driver_msg_recv)
{
    uint16_t msg_type = io_driver_msg_recv.type;

    switch (msg_type)
    {
    case IO_MSG_TYPE_BT_STATUS:
        {
            periph_handle_gap_msg(&io_driver_msg_recv);
        }
        break;
    case IO_MSG_TYPE_KEYSCAN:
        {
#if FEATURE_SUPPORT_NO_ACTION_DISCONN
            /* key event to restart no_act_disconn_timer */
            os_timer_restart(&no_act_disconn_timer, NO_ACTION_DISCON_TIMEOUT);
#endif
            if (key_handle_global_data.combine_keys_status != INVALID_COMBINE_KEYS_BIT_MASK)
            {
                /* reset combine keys bit mask and timer */
                key_handle_global_data.combine_keys_status = INVALID_COMBINE_KEYS_BIT_MASK;
                os_timer_stop(&combine_keys_detection_timer);
            }

            if (io_driver_msg_recv.subtype == IO_MSG_KEYSCAN_ALLKEYRELEASE)
            {
                key_handle_release_event();
            }
            else if (io_driver_msg_recv.subtype == IO_MSG_KEYSCAN_RX_PKT)
            {
                key_handle_pressed_event(io_driver_msg_recv.u.buf);
            }
        }
        break;
#if RCU_VOICE_EN
    case IO_MSG_TYPE_GDMA:
        APP_PRINT_INFO0("[Voice] GDMA Voice data MSG.");
        voice_global_data.gdma_intr_index++;
        if (voice_global_data.gdma_intr_index < VOICE_SKIP_GMDA_INTR_CNT)
        {
            /* skip first several GMDA interrupts, to wait codec stable */
            break;
        }
#if MP_TEST_MODE_SUPPORT_DATA_UART_TEST
        if (app_global_data.test_mode == DATA_UART_TEST_MODE)
        {
            uart_test_handle_gdma_msg(io_driver_msg_recv);
        }
        else
#endif
        {
            voice_handle_messages(VOICE_MSG_PERIPHERAL_GDMA, &io_driver_msg_recv);
        }
        break;
#endif
#if IR_FUN
    case IO_MSG_TYPE_IR:
        {
#if IR_LEARN_MODE
            ir_learn_msg_proc(io_driver_msg_recv.subtype);
#endif
            ir_send_msg_proc(io_driver_msg_recv.subtype);
        }
        break;
#endif
#if FEATURE_SUPPORT_MP_TEST_MODE
    case IO_MSG_TYPE_UART:
        {
            // uart_test_handle_uart_msg(io_driver_msg_recv);
        }
        break;
#endif
    case IO_MSG_TYPE_RESET_WDG_TIMER:
        {
            APP_PRINT_INFO0("[WDG] Watch Dog Rset Timer");
            WDG_Restart();
        }
        break;
    default:
        break;
    }
}

/******************************************************************
 * @fn          peripheral_HandleBtDevStateChangeEvt
 * @brief      All the gaprole_States_t events are pre-handled in this function.
 *                Then the event handling function shall be called according to the newState.
 *
 * @param    newState  - new gap state
 * @return     void
 */
void periph_handle_dev_state_evt(T_GAP_DEV_STATE new_state, uint16_t cause)
{
    APP_PRINT_INFO4("periph_handle_dev_state_evt: init state %d, adv state %d, conn state %d, cause 0x%x",
                    new_state.gap_init_state, new_state.gap_adv_state,
                    new_state.gap_conn_state, cause);

#if FEATURE_SUPPORT_PRIVACY
    if ((new_state.gap_init_state == GAP_INIT_STATE_STACK_READY)
        && (new_state.gap_adv_state == GAP_ADV_STATE_IDLE)
        && (new_state.gap_conn_state == GAP_CONN_DEV_STATE_IDLE))
    {
        privacy_handle_resolv_list();
    }
#endif

    if (app_global_data.gap_dev_state.gap_init_state != new_state.gap_init_state)
    {
        if (new_state.gap_init_state == GAP_INIT_STATE_STACK_READY)
        {
            APP_PRINT_INFO0("GAP stack ready");
            /* set PPCP, otherwise may cause connection update failed case */
            gaps_set_peripheral_preferred_conn_param(RCU_CONNECT_INTERVAL, RCU_CONNECT_INTERVAL,
                                                     RCU_CONNECT_LATENCY, RCU_SUPERVISION_TIMEOUT / 10);

