lihuashe/seneasy-work/RTL8752CJF-4416-5687/app/rcu/rcu_application.c
            app_global_data.rcu_status = RCU_STATUS_IDLE;

            // rcu_bat_handle(IO_MSG_TYPE_BAT_FORCE_DETECT);

#if FEATURE_SUPPORT_RECOVER_PAIR_INFO
            set_bond_info();
#endif

            T_LE_KEY_ENTRY *p_le_key_entry;
            p_le_key_entry = le_get_high_priority_bond();
            if ((p_le_key_entry != NULL) && (p_le_key_entry->is_used))
            {
                app_global_data.is_link_key_existed = true;

                /* add paired device in white list */
                le_modify_white_list(GAP_WHITE_LIST_OP_ADD, p_le_key_entry->remote_bd.addr,
                                     (T_GAP_REMOTE_ADDR_TYPE)(p_le_key_entry->remote_bd.remote_bd_type));

                /* attempt to reconnect with master */
#if FEATURE_SUPPORT_PRIVACY
                if(single_tone_test_flag != true){
                    rcu_start_adv(ADV_UNDIRECT_RECONNECT);
                }
#else
                if(single_tone_test_flag != true){
                    app_global_data.direct_adv_cnt = MAX_DIRECT_ADV_RETRY_CNT;
                    rcu_start_adv(ADV_DIRECT_HDC);
                }
#endif
            }
            else
            {
                app_global_data.is_link_key_existed = false;
            }

            app_nvic_config();  /* enable peripheral NVIC after GAP stack ready */
        }
    }

    if (app_global_data.gap_dev_state.gap_adv_state != new_state.gap_adv_state)
    {
        if (new_state.gap_adv_state == GAP_ADV_STATE_IDLE)
        {
            LED_BLINK_EXIT(LED_1, LED_TYPE_BLINK_PAIR_ADV);
            /* sync rcu status to idle */
            app_global_data.rcu_status = RCU_STATUS_IDLE;
            if (app_global_data.adv_type != ADV_DIRECT_HDC)
            {
                os_timer_stop(&adv_timer);
            }

            if (new_state.gap_adv_sub_state == GAP_ADV_TO_IDLE_CAUSE_STOP)
            {
                APP_PRINT_INFO0("Advertisng is stopped by user stop or timeouot");
#if FEATURE_SUPPORT_RECOVER_PAIR_INFO
                if (app_global_data.adv_type == ADV_UNDIRECT_PAIRING)
                {
                    set_bond_info();
                }
#endif
                /* check adv stop reason */
                app_stop_adv_reason_handler(app_global_data.stop_adv_reason);
                app_global_data.stop_adv_reason = STOP_ADV_REASON_IDLE;  /* reset stop_adv_reason */
            }
            else if (new_state.gap_adv_sub_state == GAP_ADV_TO_IDLE_CAUSE_CONN)
            {
                APP_PRINT_INFO0("Advertisng is stopped for link establishment");
            }
        }
        else if (new_state.gap_adv_state == GAP_ADV_STATE_ADVERTISING)
        {
            APP_PRINT_INFO0("GAP adv start");
            app_global_data.rcu_status = RCU_STATUS_ADVERTISING;
        }
    }

    if (app_global_data.gap_dev_state.gap_conn_state != new_state.gap_conn_state)
    {
        APP_PRINT_INFO2("conn state: %d -> %d",
                        app_global_data.gap_dev_state.gap_conn_state,
                        new_state.gap_conn_state);
    }
    app_global_data.gap_dev_state = new_state;
}

/******************************************************************
 * @brief      Handle connection status change event.
 */
void periph_handle_conn_state_evt(uint8_t conn_id, T_GAP_CONN_STATE new_state, uint16_t disc_cause)
{
    APP_PRINT_INFO3("periph_handle_conn_state_evt: conn_id = %d old_state = %d new_state = %d",
                    conn_id, app_global_data.gap_conn_state, new_state);
    switch (new_state)
    {
    case GAP_CONN_STATE_DISCONNECTED:
        {
            app_global_data.rcu_status = RCU_STATUS_IDLE;
            app_global_data.is_keyboard_notify_en = false;
            app_global_data.is_mm_keyboard_notify_en = false;
            app_global_data.is_voice_notify_en = false;
            app_global_data.is_atv_voice_notify_en = false;
#if FEATURE_SUPPORT_NO_ACTION_DISCONN
            /* stop no_act_disconn_timer if disconnection detected */
            os_timer_stop(&no_act_disconn_timer);
#endif
            os_timer_stop(&next_state_time_out);  /* ensure pair_fail_disconn_timer is stopped */

#if RCU_VOICE_EN
            if (voice_driver_global_data.is_voice_driver_working == true)
            {
                voice_global_data.is_allowed_to_notify_voice_data = false;
                voice_handle_stop_mic();
            }
#endif

            if (disc_cause == (HCI_ERR | HCI_ERR_REMOTE_USER_TERMINATE))
            {
                APP_PRINT_INFO0("[GAP_CONN_STATE_DISCONNECTED] REMOTE_USER_TERMINATE");

                if (app_global_data.is_link_key_existed == false)
                {
                    if (app_global_data.pair_failed_retry_cnt < MAX_PAIR_FAILED_RETRY_CNT)
                    {
                        app_global_data.pair_failed_retry_cnt++;
                        rcu_start_adv(ADV_UNDIRECT_PAIRING);
                    }
#if FEATURE_SUPPORT_RECOVER_PAIR_INFO
                    else
                    {
                        set_bond_info();
                    }
#endif
                }
                else{
                    app_global_data.abnormal_discon_state = 1;
                    rcu_start_adv(ADV_UNDIRECT_RECONNECT);
                }
            }
            else if (disc_cause == (HCI_ERR | HCI_ERR_LOCAL_HOST_TERMINATE))
            {
#if FEATURE_SUPPORT_RECOVER_PAIR_INFO
                if (app_global_data.disconn_reason == DISCONN_REASON_PAIRING ||
                    (app_global_data.disconn_reason == DISCONN_REASON_PAIR_FAILED &&
                     app_global_data.pair_failed_retry_cnt < MAX_PAIR_FAILED_RETRY_CNT))
                {
                    /* do nothing */
                }
                else
                {
                    set_bond_info();
                }
#endif
                /* handle APP disconection reason */
                app_disconn_reason_handler(app_global_data.disconn_reason);
            }
            else
            {
#if FEATURE_SUPPORT_RECOVER_PAIR_INFO
                set_bond_info();
#endif
                APP_PRINT_WARN1("[GAP_CONN_STATE_DISCONNECTED] Connection lost: cause 0x%x", disc_cause);
            }

