lihuashe/seneasy-work/RTL8752CJF-4416-5687/app/rcu/rcu_application.c
            app_global_data.disconn_reason = DISCONN_REASON_IDLE;  /* reset disconn_reason */
        }
        break;

    case GAP_CONN_STATE_CONNECTED:
        {
            app_global_data.rcu_status = RCU_STATUS_CONNECTED;
            os_timer_restart(&next_state_time_out, PAIRING_EXCEPTION_TIMEOUT);

            /* reset latency_status to default after connect */
            memset(&app_global_data.latency_status, 0, sizeof(app_global_data.latency_status));
            /* turn off slave latency to speed up pairing process, have to turn on latency later */
            app_set_latency_status(LATENCY_SYS_UPDATE_BIT, LANTENCY_OFF);
#if FEATURE_SUPPORT_DATA_LENGTH_EXTENSION
            uint16_t gap_param_data_len_tx_oct = 251;
            uint16_t gap_param_data_len_tx_time = 2120; /* tx max time: 2.12ms */
            le_set_data_len(conn_id, gap_param_data_len_tx_oct, gap_param_data_len_tx_time);
#endif
            /* print remote device information */
            uint16_t conn_interval;
            uint16_t conn_latency;
            uint16_t conn_supervision_timeout;
            uint8_t  remote_bd[6];
            uint8_t remote_bd_type;
            le_get_conn_param(GAP_PARAM_CONN_INTERVAL, &conn_interval, conn_id);
            le_get_conn_param(GAP_PARAM_CONN_LATENCY, &conn_latency, conn_id);
            le_get_conn_param(GAP_PARAM_CONN_TIMEOUT, &conn_supervision_timeout, conn_id);
            le_get_conn_addr(conn_id, remote_bd, &remote_bd_type);
            APP_PRINT_INFO5("GAP_CONN_STATE_CONNECTED:remote_bd %s, remote_addr_type %d, conn_interval 0x%x, conn_latency 0x%x, conn_supervision_timeout 0x%x",
                            TRACE_BDADDR(remote_bd), remote_bd_type,
                            conn_interval, conn_latency, conn_supervision_timeout);
        }
        break;

    default:
        break;
    }
    app_global_data.gap_conn_state = new_state;
}

/******************************************************************
 * @fn          peripheral_HandleBtGapAuthenStateChangeEvt
 * @brief      All the bonding state change  events are pre-handled in this function.
 *                Then the event handling function shall be called according to the newState.
 *
 * @param    newState  - new bonding state
 * @return     void
 */
void periph_handle_authen_state_evt(uint8_t conn_id, uint8_t new_state, uint16_t cause)
{
    APP_PRINT_INFO1("periph_handle_authen_state_evt:conn_id %d", conn_id);

    switch (new_state)
    {
    case GAP_AUTHEN_STATE_STARTED:
        {
            APP_PRINT_INFO0("GAP_AUTHEN_STATE_STARTED");
            os_timer_restart(&next_state_time_out, PAIRING_EXCEPTION_TIMEOUT);
        }
        break;

    case GAP_AUTHEN_STATE_COMPLETE:
        {
            if (cause == GAP_CAUSE_SUCCESS)
            {
                APP_PRINT_INFO0("[GAP_AUTHEN_STATE_COMPLETE] pairing success");
                app_global_data.is_link_key_existed = true;
                app_global_data.rcu_status = RCU_STATUS_PAIRED;
                app_global_data.pair_failed_retry_cnt = 0;
                app_global_data.updt_conn_params_retry_cnt = 0;  /* reset retry cnt */
                // if(app_global_data.adv_type == ADV_UNDIRECT_PAIRING){
                //     os_timer_restart(&pair_success_led_exit_timer, PAIR_SUCCESS_TIMEOUT);
                // }
                rcu_bat_handle(IO_MSG_TYPE_BAT_FORCE_DETECT);
                os_timer_stop(&next_state_time_out);
#if FEATURE_SUPPORT_NO_ACTION_DISCONN
                os_timer_restart(&no_act_disconn_timer, NO_ACTION_DISCON_TIMEOUT);
#endif
                if ((app_global_data.adv_type == ADV_DIRECT_HDC)
                    || (app_global_data.adv_type == ADV_UNDIRECT_RECONNECT))
                {
                    /* reconnection process */
                    if (key_handle_global_data.reconn_key_index != VK_NC)
                    {
#if (RCU_HD_PLATFORM_SEL == SRC_4416_5302)
                        if (key_handle_global_data.reconn_key_index != VK_POWER)
#elif (RCU_HD_PLATFORM_SEL == SRC_4416_5291)
                        if (key_handle_global_data.reconn_key_index != MM_POWER)
#elif (RCU_HD_PLATFORM_SEL == SRC_3925_5879)
                        if (key_handle_global_data.reconn_key_index != MM_POWER)
#endif  
                        {
                            APP_PRINT_INFO0("[GAP_AUTHEN_STATE_COMPLETE] start timer to send saved key code");
                            os_timer_restart(&notify_key_data_after_reconn_timer, NOTIFY_KEY_DATA_TIMEOUT);
                        }
                        else
                        {
                            APP_PRINT_INFO0("[GAP_AUTHEN_STATE_COMPLETE] reconn_key_index is VK_POWER");
                        }
                    }
#if (RCU_HD_PLATFORM_SEL == G_MIN_DEMO_RCU)
                    if (key_handle_global_data.reconn_key_index == MM_AC_Search)
#else
                    if (key_handle_global_data.reconn_key_index == MM_AC_Search)
#endif
                    {
                        /* voice process, start timer to postpone update paramter process */
                        os_timer_restart(&update_conn_params_timer, UPDATE_CONN_PARAMS_TIMEOUT);
                    }
                    else
                    {
                        /* update connection parameter immediately */
                        rcu_update_conn_params(RCU_CONNECT_INTERVAL, RCU_CONNECT_LATENCY,
                                               RCU_SUPERVISION_TIMEOUT);
                        app_set_latency_status(LATENCY_SYS_UPDATE_BIT, LANTENCY_ON);  /* turn on latency */
                    }
                }
                else
                {
                    LED_BLINK(LED_1, LED_TYPE_BLINK_PAIR_SUCCESS, 3);
                    key_handle_global_data.reconn_key_index = VK_NC;
                    app_global_data.adv_type = ADV_IDLE;
                    /* start timer to update connection parameter, postpone with timer to accelate GATT process */
                    os_timer_restart(&update_conn_params_timer, UPDATE_CONN_PARAMS_TIMEOUT);
                }
#if FEATURE_SUPPORT_RECOVER_PAIR_INFO
                delete_last_bond_info();
#endif
            }
            else
            {
                if (cause == (SM_ERR | SM_ERR_KEY_SAVE_FAILED))
                {
                    le_bond_clear_all_keys();
                }
                APP_PRINT_INFO0("[GAP_AUTHEN_STATE_COMPLETE] pair failed");

