lihuashe/seneasy-work/RTL8752CJF-4416-5687/app/rcu/rcu_application.c
T_APP_RESULT app_gap_callback(uint8_t cb_type, void *p_cb_data)
{
    T_APP_RESULT result = APP_RESULT_SUCCESS;
    T_LE_CB_DATA *p_data = (T_LE_CB_DATA *)p_cb_data;

    switch (cb_type)
    {
    case GAP_MSG_LE_DATA_LEN_CHANGE_INFO:
        APP_PRINT_INFO3("GAP_MSG_LE_DATA_LEN_CHANGE_INFO: conn_id %d, tx octets 0x%x, max_tx_time 0x%x",
                        p_data->p_le_data_len_change_info->conn_id,
                        p_data->p_le_data_len_change_info->max_tx_octets,
                        p_data->p_le_data_len_change_info->max_tx_time);
        break;

    case GAP_MSG_LE_BOND_MODIFY_INFO:
        APP_PRINT_INFO1("GAP_MSG_LE_BOND_MODIFY_INFO: type 0x%x",
                        p_data->p_le_bond_modify_info->type);
#if FEATURE_SUPPORT_PRIVACY
        privacy_handle_bond_modify_msg(p_data->p_le_bond_modify_info->type,
                                       p_data->p_le_bond_modify_info->p_entry, true);
#else
        app_handle_bond_modify_msg(p_data->p_le_bond_modify_info->type,
                                   p_data->p_le_bond_modify_info->p_entry);
#endif
        break;

    case GAP_MSG_LE_MODIFY_WHITE_LIST:
        APP_PRINT_INFO2("GAP_MSG_LE_MODIFY_WHITE_LIST: operation %d, cause 0x%x",
                        p_data->p_le_modify_white_list_rsp->operation,
                        p_data->p_le_modify_white_list_rsp->cause);
        break;

    case GAP_MSG_LE_DISABLE_SLAVE_LATENCY:
        APP_PRINT_INFO1("GAP_MSG_LE_DISABLE_SLAVE_LATENCY: cause 0x%x",
                        p_data->p_le_disable_slave_latency_rsp->cause);
        /* restore is_updating to false */
        app_global_data.latency_status.is_updating = false;
        if (p_data->p_le_disable_slave_latency_rsp->cause == GAP_CAUSE_SUCCESS)
        {
            app_global_data.latency_status.retry_cnt = 0;
            /* check if has any pending status */
            if (app_global_data.latency_status.is_pending == true)
            {
                APP_PRINT_INFO0("[app_gap_callback] handle onoff latency pending status");
                app_set_latency_status(app_global_data.latency_status.pending_index_bit,
                                       app_global_data.latency_status.pending_status);
            }
        }
        else
        {
            if (app_global_data.latency_status.retry_cnt < MAX_ONOFF_LATENCY_FAILED_RETRY_CNT)
            {
                APP_PRINT_WARN0("[app_gap_callback] retry onoff latency");
                app_global_data.latency_status.retry_cnt++;
                app_set_latency_status(app_global_data.latency_status.cur_index_bit,
                                       app_global_data.latency_status.cur_status);
            }
            else
            {
                APP_PRINT_ERROR0("[app_gap_callback] OnOff latency failed!");
                /* TBD: how to handle this scenario */
            }
        }
        break;

    default:
        APP_PRINT_INFO1("app_gap_callback: unhandled cb_type 0x%x", cb_type);
        break;
    }
    return result;
}

#if FEATURE_SUPPORT_PRIVACY
void app_privacy_callback(T_PRIVACY_CB_TYPE type, T_PRIVACY_CB_DATA cb_data)
{
    APP_PRINT_INFO1("app_privacy_callback: type %d", type);
    switch (type)
    {
    case PRIVACY_STATE_MSGTYPE:
        app_privacy_state = cb_data.privacy_state;
        break;

    case PRIVACY_RESOLUTION_STATUS_MSGTYPE:
        app_privacy_resolution_state = cb_data.resolution_state;
        break;

    default:
        break;
    }
}
#endif

/******************************************************************
 * @fn          app_profile_callback
 * @brief      All the bt profile callbacks are handled in this function.
 *                Then the event handling function shall be called according to the serviceID
 *                of BEE_IO_MSG.
 *
 * @param    serviceID  -  service id of profile
 * @param    pData  - pointer to callback data
 * @return     void
 */
T_APP_RESULT app_profile_callback(T_SERVER_ID service_id, void *p_data)
{
    T_APP_RESULT app_result = APP_RESULT_SUCCESS;
    if (service_id == SERVICE_PROFILE_GENERAL_ID)
    {
        app_general_srv_cb((T_SERVER_APP_CB_DATA *)p_data);
    }
    else if (service_id == app_global_data.bas_srv_id)
    {
        app_result = app_bas_srv_cb((T_BAS_CALLBACK_DATA *)p_data);
    }
    else if (service_id == app_global_data.dis_srv_id)
    {
        app_result = app_dis_srv_cb((T_DIS_CALLBACK_DATA *)p_data);
    }
    else if (service_id == app_global_data.hid_srv_id)
    {
        app_result = app_hid_srv_cb((T_HID_CALLBACK_DATA *)p_data);
    }
    else if (service_id == app_global_data.vendor_srv_id)
    {
        app_result = app_vendor_srv_cb((T_VENDOR_CALLBACK_DATA *)p_data);
    }
    else if (service_id == app_global_data.smartrcu_srv_id)
    {
        app_result = app_smartrcu_srv_cb((T_SMARTRCU_CALLBACK_DATA *)p_data);
    }
    else if (service_id == app_global_data.ota_srv_id)
    {
        app_result = app_ota_srv_cb((TOTA_CALLBACK_DATA *)p_data);
    }
#if RCU_VOICE_EN
#if (VOICE_FLOW_SEL == ATV_GOOGLE_VOICE_FLOW)
    else if (service_id == app_global_data.atvv_srv_id)
    {
        app_result = app_atvv_srv_cb((T_ATVV_CALLBACK_DATA *)p_data);
    }
#elif (VOICE_FLOW_SEL == RTK_GATT_VOICE_FLOW)
    else if (service_id == app_global_data.voice_srv_id)
    {
        app_result = app_voice_srv_cb((T_VOICE_CALLBACK_DATA *)p_data);
    }
#endif
#endif
    return app_result;
}
